[
  {
    "type": "introduction",
    "content": "Hello Babak, We are excited to share the audio version of your research paper on the Cognitive Training Trial. At Paper2Audio, we use AI to create our audio narratives, including all the text of the paper without summarizing it, plus AI-generated summaries of all tables, figures and math. This is a work in progress. We appreciate your feedback. This paper concludes that advanced cognitive training resulted in improvements for the elderly population studied. Now let us proceed with the paper.",
    "page": 1
  },
  {
    "type": "main_title",
    "content": "Ten-Year Effects of the Advanced Cognitive Training for Independent and Vital Elderly Cognitive Training Trial on Cognition and Everyday Functioning in Older Adults",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 1
  },
  {
    "type": "improved_author_info",
    "content": "There are 11 authors, including [break0.6]George W. Rebok from Johns Hopkins University, [break0.6]Karlene Ball from University of Alabama at Birmingham, [break0.6]Lin T. Guey, Hae-Young Kim from New England Research Institutes, [break0.6]Richard N. Jones from Hebrew SeniorLife",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 1
  },
  {
    "type": "abstract_content",
    "content": "OBJECTIVES: To determine the effects of cognitive training on cognitive abilities and everyday function over 10 years. DESIGN: Ten-year follow-up of a randomized, controlled single-blind trial (Advanced Cognitive Training for Independent and Vital Elderly (ACTIVE)) with three intervention groups and a no-contact control group. SETTING: Six U.S. cities. PARTICIPANTS: A volunteer sample of 2,832 persons (mean baseline age 73.6; 26% African American) living independently. INTERVENTION: Ten training sessions for memory, reasoning, or speed of processing; four sessions of booster training 11 and 35 months after initial training. MEASUREMENTS: Objectively measured cognitive abilities and self-reported and performance-based measures of everyday functioning. RESULTS: Participants in each intervention group reported less difficulty with instrumental activities of daily living (I.A.D.Ls) (memory: effect size = 0.48, 99% confidence interval (C.I) = 0.12–0.84; reasoning: effect size = 0.38, 99% C.I = 0.02–0.74; speed of processing: effect size = 0.36, 99% C.I = 0.01–0.72). At a mean age of 82, approximately 60% of trained participants, versus 50% of controls (P < .05), were at or above their baseline level of self-reported I.A.D.L function at 10 years. The reasoning and speed-of-processing interventions maintained their effects on their targeted cognitive abilities at 10 years (reasoning: effect size = 0.23, 99% C.I = 0.09–0.38; speed of processing: effect size = 0.66, 99% C.I = 0.43–0.88). Memory training effects were no longer maintained for memory performance. Booster training produced additional and durable improvement for the reasoning intervention for reasoning performance (effect size = 0.21, 99% C.I = 0.01–0.41) and the speed-of-processing intervention for speed-of-processing performance (effect size = 0.62, 99% C.I = 0.31–0.93). CONCLUSION: Each Advanced Cognitive Training for Independent and Vital Elderly cognitive intervention resulted in less decline in self-reported I.A.D.L compared with the control group. Reasoning and speed, but not memory, training resulted in improved targeted cognitive abilities for 10 years.",
    "mathSymbolFrequency": 5,
    "hasCitations": false,
    "allAbbreviations": [
      {
        "abbreviation": "IADLs",
        "expansion": "instrumental activities of daily living",
        "type": "pronounced_with_initials"
      },
      {
        "abbreviation": "CI",
        "expansion": "confidence interval",
        "type": "pronounced_with_initials"
      },
      {
        "abbreviation": "ACTIVE",
        "expansion": "Advanced Cognitive Training for Independent and Vital Elderly",
        "type": "pronounced_as_a_single_word"
      }
    ],
    "page": 1
  },
  {
    "type": "heading",
    "content": "[break0.7]METHODS[break0.7]",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 2
  },
  {
    "type": "heading",
    "content": "[break0.7]Design and Participants[break0.7]",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 2
  },
  {
    "type": "text",
    "content": "Advanced Cognitive Training for Independent and Vital Elderly is a multisite, randomized, controlled clinical trial, with recruitment from March 1998 through October 1999 in six metropolitan areas. Community-dwelling adults aged 65 and older were eligible. Exclusion criteria were significant cognitive dysfunction (Mini-Mental State Examination (M.M.S.E) score <23); functional impairment (dependency or regular assistance in activities of daily living (A.D.Ls) on Minimum Dataset (M.D.S) Home Care); self-reported diagnosis of Alzheimer’s disease, stroke within the last 12 months, or certain cancers; current chemotherapy or radiation therapy; or poor vision, hearing, or communicative ability that would have interfered with the intervention or outcome assessments. Participants (N = 2,832, average age 73.6, average education 13 years, 74% white and 26% African American, 76% female) were randomly assigned to one of three intervention groups (memory, reasoning, or speed-of-processing training) or a no-contact control group. Outcome assessments were conducted immediately and 1, 2, 3, 5, and 10 years after the intervention. Institutional review boards at participating institutions approved study procedures, and all participants provided written informed consent.",
    "mathSymbolFrequency": 0,
    "hasCitations": true,
    "allAbbreviations": [
      {
        "abbreviation": "ACTIVE",
        "expansion": "Advanced Cognitive Training for Independent and Vital Elderly",
        "type": "pronounced_as_a_single_word"
      },
      {
        "abbreviation": "MMSE",
        "expansion": "Mini-Mental State Examination",
        "type": "pronounced_with_initials"
      },
      {
        "abbreviation": "ADLs",
        "expansion": "activities of daily living",
        "type": "pronounced_with_initials"
      },
      {
        "abbreviation": "MDS",
        "expansion": "Minimum Dataset",
        "type": "pronounced_with_initials"
      }
    ],
    "page": 2,
    "isStartCutOff": false,
    "isEndCutOff": false,
    "replacedCitations": true
  },
  {
    "type": "heading",
    "content": "[break0.7]Interventions[break0.7]",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 2
  },
  {
    "type": "text",
    "content": "ACTIVE training focused on memory, reasoning, and speed-of-processing because prior research indicated that these abilities show early age-related decline and are related to activities of daily living. Training was conducted in small groups in ten 60- to 75-minute sessions over 5 to 6 weeks. Memory training focused on improving verbal episodic memory through instruction and practice in strategy use. Reasoning training focused on improving ability to solve problems that contain a serial pattern. Speed-of-processing training focused on visual search and ability to process increasingly more-complex information presented in successively shorter inspection times. Booster training (four 75-minute sessions) was provided at 11 and 35 months after training to a random subset (39%) of participants in each training group who completed at least eight of 10 training sessions; 60% of selected participants completed booster training at Years 1 and 3, 19% completed Year 1 booster only, 6% completed Year 3 booster only, and 15% did not complete any booster training. Sixty-one percent of the total sample (n = 1,694) was not selected to receive booster training.",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [
      {
        "abbreviation": "ADLs",
        "expansion": "activities of daily living",
        "type": "pronounced_with_initials"
      }
    ],
    "page": 2,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "heading",
    "content": "[break0.7]Outcome Measures[break0.7]",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 2
  },
  {
    "type": "text",
    "content": "Cognitive outcome measures assessed the effect of each cognitive training intervention on its targeted cognitive ability. Memory outcomes involved measures of episodic verbal memory: Rey Auditory-Verbal Learning Test total of five learning trials, the Hopkins Verbal Learning Test total of three learning trials, and the Rivermead Behavioural Paragraph Recall test immediate recall. Reasoning outcomes involved measures requiring identification of patterns including total correct for Letter Series, Letter Sets, and Word Series. Speed-of-processing outcomes involved three Useful Field of View (U.F.O.V) tasks requiring identification and location of information, with 75% accuracy, under varying levels of cognitive demand. Functional outcome measures were used to assess whether training-related cognitive improvements improved everyday function. There were three measure of daily function. The self-reported measure of everyday Instrumental Activities of Daily Living function was the Instrumental Activities of Daily Living difficulty subscore from the Minimum Dataset Home Care, which assesses performance in the past 7 days on 19 daily tasks spanning meal preparation, housework, finances, health care, telephoning, shopping, travel, and need for assistance in dressing, personal hygiene, and bathing. The validity and clinical utility of Minimum Dataset scores have been demonstrated. The performance-based measure of daily function were Everyday Problem Solving, comprising the Everyday Problems Test and Observed Tasks of Daily Living; and Everyday Speed, comprising Complex Reaction Time and Timed Instrumental Activities of Daily Living.",
    "mathSymbolFrequency": 0,
    "hasCitations": true,
    "allAbbreviations": [
      {
        "abbreviation": "UFOV",
        "expansion": "Useful Field of View",
        "type": "pronounced_with_initials"
      },
      {
        "abbreviation": "IADL",
        "expansion": "Instrumental Activities of Daily Living",
        "type": "pronounced_with_initials"
      },
      {
        "abbreviation": "MDS",
        "expansion": "Minimum Dataset",
        "type": "pronounced_with_initials"
      }
    ],
    "page": 2,
    "isStartCutOff": false,
    "isEndCutOff": false,
    "replacedCitations": true
  },
  {
    "type": "heading",
    "content": "[break0.7]Analysis[break0.7]",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 2
  },
  {
    "type": "text",
    "content": "To evaluate the effects of ACTIVE training, an intention-to-treat analysis was conducted using a repeated-measures mixed-effects model for each cognitive and daily function composite outcome. Several design features and three interaction terms were included in these models to measure the net effect of training and the net effect and added effect of booster training. Time was treated as a categorical variable (baseline, 1, 2, 3, 5, 10 years). Baseline measures of age, sex, cognitive status (Mini-Mental State Examination score), years of education, and visual acuity were also included.",
    "mathSymbolFrequency": 0,
    "hasCitations": true,
    "allAbbreviations": [
      {
        "abbreviation": "ACTIVE",
        "expansion": "Advanced Cognitive Training for Independent and Vital Elderly",
        "type": "pronounced_as_a_single_word"
      },
      {
        "abbreviation": "MMSE",
        "expansion": "Mini-Mental State Examination",
        "type": "pronounced_with_initials"
      }
    ],
    "page": 2,
    "isStartCutOff": false,
    "isEndCutOff": false,
    "replacedCitations": true
  },
  {
    "type": "text",
    "content": "Training effects were assessed by comparing mean improvement from baseline to Year 10 in each of the three training groups with mean improvement from baseline to Year 10 in the nontrained control group. Effects of booster training were assessed similarly by comparing mean improvement from baseline to Year 10 in subjects receiving booster training with mean improvement from baseline to Year 10 in subjects who did not receive booster training.",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 2,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "This comparison was made for each of the three cognitive interventions. The analyses were first performed using available data. Then the effect of missing data was assessed by repeating the analysis using multiple imputation28,29 and by conducting a sensitivity analysis that forced missing cognitive and daily function scores to be low. All statistical tests were two-sided. Analyses were conducted at the data coordinating center using R version 2.12.0.30",
    "mathSymbolFrequency": 0,
    "hasCitations": true,
    "allAbbreviations": [],
    "page": 3,
    "isStartCutOff": false,
    "isEndCutOff": true
  },
  {
    "type": "text",
    "content": "Results are presented as effect sizes, which quantify the size of the difference between a training group and the control group and provide a way to compare this difference between the training groups (e.g., does reasoning training have a better effect than memory training on each cognitive and daily function outcome). Cohen describes an effect size of 0.2 as small, 0.5 as medium, and 0.8 as large. Because the analyses included six comparisons, a corrected significance level of P < .008 was used.",
    "mathSymbolFrequency": 1,
    "hasCitations": true,
    "allAbbreviations": [],
    "page": 3,
    "isStartCutOff": false,
    "isEndCutOff": false,
    "replacedCitations": true
  },
  {
    "type": "text",
    "content": "In addition, the percentage of participants who showed reliable improvement in each training group was investigated using standard error of measurement (S.E.M). Participants were classified as having improved reliably on a particular measure if their score at 10 years exceeded their baseline score on that measure by 0.66 S.E.M or was within 0.66 S.E.M of the baseline score. For the purposes of this study, this was considered maintenance of performance. For each training group, the percentage with reliable change on each cognitive and daily function outcome was compared with that of the control group.",
    "mathSymbolFrequency": 1,
    "hasCitations": true,
    "allAbbreviations": [
      {
        "abbreviation": "SEM",
        "expansion": "standard error of measurement",
        "type": "pronounced_with_initials"
      }
    ],
    "page": 3,
    "isStartCutOff": false,
    "isEndCutOff": false,
    "replacedCitations": true
  },
  {
    "type": "heading",
    "content": "[break0.7]RESULTS[break0.7]",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 3
  },
  {
    "type": "heading",
    "content": "[break0.7]Sample Characteristics[break0.7]",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 3
  },
  {
    "type": "text",
    "content": "Of 5,000 individuals contacted for participation, 2,802 were randomized in accordance with the protocol and constitute the analytical sample. Of those not randomized, approximately 41% were ineligible, 57% refused, and 1% were improperly randomized (Figure 1). Participants were less likely than those who refused to be female (76% vs 79%) and younger (mean age 74 vs 75) and more likely to be white (73% vs 60%), married (36% vs 27%), and better educated (mean 13.5 vs 12.3 years). Participants had higher M.M.S.E scores (mean 27.3 vs 26.8) and were less likely to have heart disease (11% vs 14%) and diabetes mellitus (13% vs 17%) than were those who refused.",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [
      {
        "abbreviation": "MMSE",
        "expansion": "Mini-Mental State Examination",
        "type": "pronounced_with_initials"
      }
    ],
    "page": 3,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "figure_image",
    "content": "Figure 1  summary:\nThe flowchart illustrates the profile of the ACTIVE trial, starting with 5,000 participants assessed for eligibility. Out of these, 2,832 were randomized into four groups: Memory Training, Reasoning Training, Speed Training, and a Control group. The chart details the intervention process, immediate post-test results, booster sessions, and follow-ups at 1, 2, 3, 5, and 10 years. It includes information on participant attrition due to death, withdrawal, and site decisions, as well as the number of participants assessed at each stage. The chart highlights the long-term follow-up and attrition rates over the 10-year period.",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 4,
    "label": {
      "labelType": "Figure",
      "labelNumber": "1",
      "panelNumber": ""
    },
    "repositioned": true
  },
  {
    "type": "text",
    "content": "Baseline characteristics are shown in Table 1 according to intervention group. Eighty-nine percent of participants completed the training intervention. Those who completed the intervention were younger and had more education and higher baseline M.M.S.E and cognitive function scores.",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [
      {
        "abbreviation": "MMSE",
        "expansion": "Mini-Mental State Examination",
        "type": "pronounced_with_initials"
      }
    ],
    "page": 3,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "table_rows",
    "content": "Table 1  summary:\nThe table presents baseline characteristics of participants across four groups: Memory, Reasoning, Speed of Processing, and Control. The average age is around 73.5 years, with a slightly higher average in the Control group. The majority of participants are female, ranging from 73.6% to 76.8%. Most participants are White, followed by Black, with a small percentage categorized as Other or unknown. Education levels are similar across groups, averaging about 13.5 years. Marriage rates are around 35-37%. Cognitive scores and physical function scores are comparable among groups. Alcohol consumption varies, with the Control group having the highest percentage of nondrinkers. Depression scores are low across all groups. Common health issues include hypertension, diabetes, and chronic obstructive pulmonary disease, with similar prevalence across groups.",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [
      {
        "abbreviation": "SD",
        "expansion": "Standard Deviation",
        "type": "pronounced_with_initials"
      }
    ],
    "page": 5,
    "label": {
      "labelType": "Table",
      "labelNumber": "1",
      "panelNumber": ""
    },
    "repositioned": true
  },
  {
    "type": "text",
    "content": "Sixty-seven percent of the sample was retained 5 years after training and 44% at 10 years. Death (40%) was the primary reason for nonparticipation at 10 years, followed by participant decision to withdraw (35%) or site decision to withdraw the participant because of continued missed visits in the absence of explicit refusal (17%). Predictors of attrition at 10 years included older age, male sex, not being married, higher alcohol consumption, more physical and mental health problems, and worse performance on cognitive outcomes. Attrition rates and predictors of attrition were similar between intervention groups.",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 3,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "heading",
    "content": "[break0.7]Training Effects on Cognitive Abilities[break0.7]",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 3
  },
  {
    "type": "text",
    "content": "Mean scores at baseline, change from baseline to Year 10, and the effect size of the intervention on each cognitive outcome are shown in Table 2. All interventions produced immediate improvement in the trained cognitive ability (Figure 2). This improvement was retained for 10 years in the reasoning and speed trained groups (Table 2). The effect sizes indicate a small effect of the reasoning intervention (0.23) on the reasoning outcome and a medium to large effect of the speed intervention (0.66) on the speed outcome at 10 years. The effect of the memory intervention (0.06) on the memory outcome at 10 years was not significant.",
    "mathSymbolFrequency": 1,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 3,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "figure_image",
    "content": "Figure 2  summary:\nFigure 2 shows cognitive outcomes over time for different training groups. Graph A represents memory scores, Graph B shows reasoning scores, and Graph C illustrates speed of processing scores. Each graph displays mean scores for each cognitive outcome across various time points, with higher scores indicating better performance. The sample sizes indicate the number of participants with complete data at each time point.",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 7,
    "label": {
      "labelType": "Figure",
      "labelNumber": "2",
      "panelNumber": "unlabeled"
    },
    "repositioned": true
  },
  {
    "type": "table_rows",
    "content": "Table 2  summary:\nThe table presents the effect of training on cognitive and functional outcomes over ten years. It compares the three treatments, memory, reasoning and speed of processing, to a control group.  The memory treatment did not produce a statistically significant change in the the memory assessment, whereas the reasoning and speed treatments did for their assessments.  After the reasoning treatment, 73.6 percent scored at or above their baseline level after 10 years, compared to 61.7 percent in the control group.  Similarly, after the speed of processing treatment, 70.7 percent scored at or above their baseline level after 10 years, compared to 47.8 in the control group.  In both of these cases, the comparison is statistically significant, with P less than 0.01.  All three treatments improved instrumental activity of daily living difficulty, with the 3 changes all being statistically significant.  The other two outcomes measured were everyday problem solving and everyday speed of processing, both of which did not have statistically significant changes from the treatments.",
    "mathSymbolFrequency": 5,
    "hasCitations": true,
    "allAbbreviations": [],
    "page": 6,
    "label": {
      "labelType": "Table",
      "labelNumber": "2",
      "panelNumber": ""
    },
    "repositioned": true
  },
  {
    "type": "text",
    "content": "Similarly, there were significant effects of booster training for the reasoning (effect size = 0.21, confidence interval = 0.01–0.41) and speed (effect size = 0.62, 99% confidence interval = 0.31–0.93) interventions but not for the memory intervention.",
    "mathSymbolFrequency": 1,
    "hasCitations": false,
    "allAbbreviations": [
      {
        "abbreviation": "CI",
        "expansion": "confidence interval",
        "type": "pronounced_with_initials"
      }
    ],
    "page": 3,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "Results on the basis of reliable maintenance of cognitive function at 10 years (Table 2) show that 73.6% of reasoning-trained participants and 70.7% of speed-trained participants were performing at or above their respective cognitive ability, compared with 61.7% and 48.8%, respectively, of control participants (P < .01). The results for memory-trained participants were not significant.",
    "mathSymbolFrequency": 1,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 3,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "heading",
    "content": "[break0.7]Training Effects on Daily Function[break0.7]",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 3
  },
  {
    "type": "text",
    "content": "At Year 10, participants in all three intervention groups reported less difficulty performing I.A.D.Ls than did those in control groups during Years 3 to 5 but not thereafter (Table S1). The decline in self-reported I.A.D.L function was first evident between Years 2 and 3 for all groups. From Years 3 to 5, the decline was less in the three intervention groups than in the control group. This difference in self-reported I.A.D.L function between trained participants and nontrained control participants was then maintained as all participants continued to decline (report more I.A.D.L difficulties) from Years 5 to 10.",
    "mathSymbolFrequency": 1,
    "hasCitations": false,
    "allAbbreviations": [
      {
        "abbreviation": "IADL",
        "expansion": "Instrumental Activities of Daily Living",
        "type": "pronounced_with_initials"
      }
    ],
    "page": 3,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "Results of the reliable maintenance analysis (Table 2) are consistent with this pattern of temporal decline. Whereas at Year 10 years, 49.3% of control participants assessed the same or improved level of I.A.D.L difficulty as at baseline, the proportions of trained participants reporting the same or improved level of I.A.D.L difficulty were significantly higher (memory, 61.6%; reasoning, 60.2%; speed, 58.5%). There was no effect of training (Table S2) or added booster training (not shown) on performance-based measures of everyday function. Finally, the results of models using multiple imputation for missing data and results of the sensitivity analysis (data not shown) were the same as the main results reported above.",
    "mathSymbolFrequency": 1,
    "hasCitations": true,
    "allAbbreviations": [
      {
        "abbreviation": "IADL",
        "expansion": "Instrumental Activities of Daily Living",
        "type": "pronounced_with_initials"
      }
    ],
    "page": 3,
    "isStartCutOff": false,
    "isEndCutOff": false,
    "replacedCitations": true
  },
  {
    "type": "heading",
    "content": "[break0.7]DISCUSSION[break0.7]",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 3
  },
  {
    "type": "text",
    "content": "In the ACTIVE trial, 10 to 14 weeks of organized cognitive training delivered to community-dwelling older adults resulted in significant improvements in cognitive abilities and better preserved functional status than in nontrained individuals.",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [
      {
        "abbreviation": "ACTIVE",
        "expansion": "",
        "type": "pronounced_as_a_single_word"
      }
    ],
    "page": 3,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "persons 10 years later Each training intervention produced large and significant improvements in the trained cognitive ability These improvements dissipated slowly but persisted to at least years for memory training and to years for reasoning and speed-of-processing training This is the first demonstration of long-term transfer of the training effects on cognitive abilities to daily function Unlike for the nontrained participants cognitive function for the majority of the reasoning and speed-trained participants was at or above their baseline level for the trained cognitive ability years later A significant percentage of participants in all trained groups continued to report less difficulty performing I.A.D.Ls than nontrained participants After years to of participants were as well off as or better off than when they started Others have reported the absence of long-term memory training effects It is possible that the memory training used in ACTIVE requires more extensive practice or greater dosage to reach durability levels than reasoning and speed training It is also possible that age-related structural changes in the medial temporal lobe including age-related neuropathology and even incipient Alzheimer’s disease in some participants limits the durability of memory training in older adults There are a number of possible reasons for the finding that training effects on self-reported daily function are maintained over time whereas the training effects on cognitive abilities dissipate over time First this could reflect a cascade relationship between cognitive ability and daily function Prospective observational studies indicate that changes in cognition precede changes in daily function by several years Second improved cognitive processing may alter patterns of neural activation over the long term Third training-based improvements in cognitive abilities may produce changes in behavior and social interaction that promote broad-based engagement in functional activities and maintenance over many years The effects of cognitive training on daily function in this study were modest This is probably because many factors beyond cognition affect daily function and functional independence including sex social class mood sarcopenia obesity chronic diseases and social isolation Even within the cognitive realm some domains such as general cognitive status and executive cognitive ability may be more closely related to daily function than other domains eg spatial skills The current study showed weak to absent effects of cognitive training on performance-based measures of daily function It is probably a mistake to conceive of these performance-based functional measures as something other than cognitive tests The administration formats task demands and scoring all have more in common with standard cognitive tests than with actual A.D.Ls In addition",
    "mathSymbolFrequency": 0,
    "hasCitations": true,
    "allAbbreviations": [
      {
        "abbreviation": "IADLs",
        "expansion": "Instrumental Activities of Daily Living",
        "type": "pronounced_with_initials"
      },
      {
        "abbreviation": "ACTIVE",
        "expansion": "Advanced Cognitive Training for Independent and Vital Elderly",
        "type": "pronounced_as_a_single_word"
      },
      {
        "abbreviation": "ADLs",
        "expansion": "Activities of Daily Living",
        "type": "pronounced_with_initials"
      }
    ],
    "page": 5,
    "isStartCutOff": true,
    "isEndCutOff": true
  },
  {
    "type": "text",
    "content": "these performance-based measures call on multiple cognitive skills.",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 6,
    "isStartCutOff": true,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "A main lesson of the ACTIVE study and other cognitive intervention trials is that the benefits of cognitive training are specific to the cognitive ability trained.",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [
      {
        "abbreviation": "ACTIVE",
        "expansion": "Advanced Cognitive Training for Independent and Vital Elderly",
        "type": "pronounced_as_a_single_word"
      }
    ],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "Viewed in this way, it is not surprising that specific forms of cognitive training used in ACTIVE did not result in improvements on performance-based measures of daily function that are really multi-ability cognitive tests.",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [
      {
        "abbreviation": "ACTIVE",
        "expansion": "Advanced Cognitive Training for Independent and Vital Elderly",
        "type": "pronounced_as_a_single_word"
      }
    ],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "The ACTIVE 10-year retention rate was 44%.",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [
      {
        "abbreviation": "ACTIVE",
        "expansion": "Advanced Cognitive Training for Independent and Vital Elderly",
        "type": "pronounced_as_a_single_word"
      }
    ],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "Death was the primary reason for nonparticipation (40%), followed by the subject’s decision to stop participation (35%) and the site’s decision to withdraw the subject (17%).",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "In comparison, the Diabetes Prevention Program (D.P.P) reported a 10-year retention rate of 59%, although D.P.P participants were more than 20 years younger (50±6) at enrollment than were ACTIVE participants at enrollment (73).",
    "mathSymbolFrequency": 1,
    "hasCitations": true,
    "allAbbreviations": [
      {
        "abbreviation": "DPP",
        "expansion": "Diabetes Prevention Program",
        "type": "pronounced_with_initials"
      },
      {
        "abbreviation": "ACTIVE",
        "expansion": "Advanced Cognitive Training for Independent and Vital Elderly",
        "type": "pronounced_as_a_single_word"
      }
    ],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false,
    "replacedCitations": true
  },
  {
    "type": "text",
    "content": "The 10-year retention rate compares favorably with rates in observational studies of similar duration and samples of similar ages and ethnic diversity.",
    "mathSymbolFrequency": 0,
    "hasCitations": true,
    "allAbbreviations": [
      {
        "abbreviation": "DPP",
        "expansion": "Diabetes Prevention Program",
        "type": "pronounced_with_initials"
      }
    ],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false,
    "replacedCitations": true
  },
  {
    "type": "text",
    "content": "Although retained subjects were younger and had fewer physical and mental health problems at baseline, there was no difference between groups in attrition.",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "This means that the training effects observed were not an artifact of differential attrition.",
    "mathSymbolFrequency": 1,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "Furthermore, in recognition of this attrition, appropriate methods were used to test assumptions about missing data and the validity of the inferences.",
    "mathSymbolFrequency": 1,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "First, the linear mixed-effects models are appropriate for situations with informative missingness and informative censoring.",
    "mathSymbolFrequency": 1,
    "hasCitations": true,
    "allAbbreviations": [],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false,
    "replacedCitations": true
  },
  {
    "type": "text",
    "content": "In addition, the effect of missing data on the outcomes were analyzed using multiple imputation and a sensitivity analysis that assumed that missing outcome scores were low.",
    "mathSymbolFrequency": 1,
    "hasCitations": true,
    "allAbbreviations": [],
    "page": 6,
    "isStartCutOff": true,
    "isEndCutOff": false,
    "replacedCitations": true
  },
  {
    "type": "text",
    "content": "Results of the analysis using multiple imputation and the sensitivity analysis were similar to the results of the mixed-effects models.",
    "mathSymbolFrequency": 1,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "Therefore, it is likely that the results regarding the effects of cognitive training interventions are robust.",
    "mathSymbolFrequency": 1,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "The evaluation of the effect of booster training is limited because the two groups of interest (booster trained and non-booster trained) are not comparable.",
    "mathSymbolFrequency": 1,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "To be eligible for selection for booster training, participants had to have completed at least 80% of baseline training.",
    "mathSymbolFrequency": 1,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "In contrast, only 20% of non-booster-trained participants completed baseline training.",
    "mathSymbolFrequency": 1,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "Therefore, the non-booster-trained group was overrepresented by persons who did not complete baseline training.",
    "mathSymbolFrequency": 1,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 6,
    "isStartCutOff": false,
    "isEndCutOff": false
  },
  {
    "type": "text",
    "content": "complete baseline training and reflected neither participants who completed baseline training nor nontrained participants (the control group) but something in between. In summary, ACTIVE was the first multisite clinical trial to test the effects of cognitive training interventions on cognitive abilities and daily function. Results at 10 years demonstrate that cognitive training has beneficial effects on cognitive abilities and on self-reported I.A.D.L function. These results provide support for the development of other interventions, particularly those that target multiple cognitive abilities and are more likely to have an effect on I.A.D.L performance. Such interventions have the potential to delay onset of functional decline and possibly dementia and are consistent with comprehensive geriatric care that strives to maintain and support functional independence. If interventions that could delay onset of functional impairment by even 6 years were introduced, the number of people affected by 2050 would be reduced by 38%, which would be of great public health significance.",
    "mathSymbolFrequency": 0,
    "hasCitations": true,
    "allAbbreviations": [
      {
        "abbreviation": "ACTIVE",
        "expansion": "Advanced Cognitive Training for Independent and Vital Elderly",
        "type": "pronounced_as_a_single_word"
      },
      {
        "abbreviation": "IADL",
        "expansion": "Instrumental Activity of Daily Living",
        "type": "pronounced_with_initials"
      }
    ],
    "page": 7,
    "isStartCutOff": true,
    "isEndCutOff": false,
    "replacedCitations": true
  },
  {
    "type": "figure_image",
    "content": "Figure 3  summary:\nFigure 3 shows the effects of training on self-reported Instrumental Activity of Daily Living (IADL) difficulty scores over time for different training groups. The graph displays mean IADL difficulty scores at various time points, with higher scores indicating better functioning. The sample sizes indicate the number of participants with complete data at each time point.",
    "mathSymbolFrequency": 0,
    "hasCitations": false,
    "allAbbreviations": [],
    "page": 7,
    "label": {
      "labelType": "Figure",
      "labelNumber": "3",
      "panelNumber": "unlabeled"
    },
    "repositioned": true
  }
]
